In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [3]:
data=pd.read_csv("http://rcs.bu.edu/examples/python/data_analysis/Salaries.csv")

In [4]:
data.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 78 entries, 0 to 77
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   rank        78 non-null     object
 1   discipline  78 non-null     object
 2   phd         78 non-null     int64
 3   service     78 non-null     int64
 4   sex         78 non-null     object
 5   salary      78 non-null     int64
dtypes: int64(3), object(3)
memory usage: 3.8+ KB

In [6]:
data.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [7]:
data.tail()

         rank discipline  phd  service     sex  salary
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

In [8]:
data.head(10)

        rank discipline  phd  service   sex  salary
0       Prof          B   56       49  Male  186960
1       Prof          A   12        6  Male   93000
2       Prof          A   23       20  Male  110515
3       Prof          A   40       31  Male  131205
4       Prof          B   20       18  Male  104800
5       Prof          A   20       20  Male  122400
6  AssocProf          A   20       17  Male   81285
7       Prof          A   18       18  Male  126300
8       Prof          A   29       19  Male   94350
9       Prof          A   51       51  Male   57800

In [9]:
data[0:10]

        rank discipline  phd  service   sex  salary
0       Prof          B   56       49  Male  186960
1       Prof          A   12        6  Male   93000
2       Prof          A   23       20  Male  110515
3       Prof          A   40       31  Male  131205
4       Prof          B   20       18  Male  104800
5       Prof          A   20       20  Male  122400
6  AssocProf          A   20       17  Male   81285
7       Prof          A   18       18  Male  126300
8       Prof          A   29       19  Male   94350
9       Prof          A   51       51  Male   57800

In [11]:
data.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [22]:
data.columns.values.size

6

In [23]:
data.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [25]:
data.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [28]:
data.sample(10)

         rank discipline  phd  service     sex  salary
3        Prof          A   40       31    Male  131205
56  AssocProf          A   10        8  Female   77500
44       Prof          B   23       19  Female  151768
32       Prof          A   27       19    Male  103275
72       Prof          B   24       15  Female  161101
59  AssocProf          B   12       10  Female  103994
54  AssocProf          A   25       22  Female   62884
66   AsstProf          A    7        6  Female   63100
68   AsstProf          A    4        2  Female   77500
49       Prof          B   17       18  Female  122960

In [29]:
data.discipline.value_counts()

B    42
A    36
Name: discipline, dtype: int64

hii i am heet

## Hello Heet

In [30]:
data.std()

phd           12.498425
service       12.139768
salary     28293.661022
dtype: float64

In [31]:
data.head(50).mean()

phd            21.52
service        17.60
salary     113789.14
dtype: float64

In [34]:
data[0:50].mean()

phd            21.52
service        17.60
salary     113789.14
dtype: float64

In [35]:
data[['rank']]

         rank
0        Prof
1        Prof
2        Prof
3        Prof
4        Prof
..        ...
73       Prof
74  AssocProf
75       Prof
76       Prof
77       Prof

[78 rows x 1 columns]

In [38]:
data.phd.values

array([56, 12, 23, 40, 20, 20, 20, 18, 29, 51, 39, 23,  1, 35, 25, 17,  8,
        4, 19, 29,  4, 33,  4,  2, 30, 35, 38, 45,  7, 21,  9, 22, 27, 18,
       12, 28, 45, 20,  4, 18, 39, 13,  4,  5, 23, 25, 11, 11, 17, 17, 10,
       20, 12,  5, 25,  2, 10,  3, 36, 12,  3, 13, 14, 29, 26, 36,  7, 17,
        4, 28,  8, 12, 24, 18, 19, 17, 28, 23], dtype=int64)

In [39]:
data.phd.mean()

19.705128205128204

In [40]:
data.groupby(by='rank').mean()

                 phd    service         salary
rank
AssocProf  15.076923  11.307692   91786.230769
AsstProf    5.052632   2.210526   81362.789474
Prof       27.065217  21.413043  123624.804348